In [3]:
import pandas as pd
import numpy as np

In [5]:
# Read test data

rf=pd.read_csv('Titanic_test.csv')

In [7]:
rf.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [9]:
rf.shape

(418, 11)

In [11]:
import math

#Finding the sum of null values in the columns

In [15]:
rf.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [17]:
# Datatypes of columns

In [21]:
rf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

In [23]:
rf.Name.value_counts()

Name
Kelly, Mr. James               1
Carr, Miss. Jeannie            1
Dennis, Mr. William            1
Rosblom, Miss. Salli Helena    1
Touma, Miss. Maria Youssef     1
                              ..
Zakarian, Mr. Mapriededer      1
Carlsson, Mr. Carl Robert      1
Dintcheff, Mr. Valtcho         1
Thomas, Mr. Charles P          1
Peter, Master. Michael J       1
Name: count, Length: 418, dtype: int64

In [25]:
# Since name column is categorical and with unique values, this is changed into index

rf_new=rf.set_index('Name')
rf_new

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,
"Kelly, Mr. James",892,3,male,34.5,0,0,330911,7.8292,NaN,Q
"Wilkes, Mrs. James (Ellen Needs)",893,3,female,47.0,1,0,363272,7.0000,NaN,S
"Myles, Mr. Thomas Francis",894,2,male,62.0,0,0,240276,9.6875,NaN,Q
"Wirz, Mr. Albert",895,3,male,27.0,0,0,315154,8.6625,NaN,S
"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",896,3,female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
"Spector, Mr. Woolf",1305,3,male,NaN,0,0,A.5. 3236,8.0500,NaN,S
"Oliva y Ocana, Dona. Fermina",1306,1,female,39.0,0,0,PC 17758,108.9000,C105,C
"Saether, Mr. Simon Sivertsen",1307,3,male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
"Ware, Mr. Frederick",1308,3,male,NaN,0,0,359309,8.0500,NaN,S
"Peter, Master. Michael J",1309,3,male,NaN,1,1,2668,22.3583,NaN,C

In [27]:
rf_new.Sex.value_counts()

Sex
male      266
female    152
Name: count, dtype: int64

In [31]:
rf_new[rf_new.duplicated()]

Empty DataFrame
Columns: [PassengerId, Pclass, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [35]:
 (327/418 )* 100

78.22966507177034

In [ ]:
# Cabin column can be removed as it consists of null values more than 40%

In [37]:
rf_new=rf_new.drop(['Cabin'],axis=1)

In [39]:
rf_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 418 entries, Kelly, Mr. James to Peter, Master. Michael J
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    object
 3   Age          332 non-null    float64
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Ticket       418 non-null    object
 7   Fare         417 non-null    float64
 8   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 48.8+ KB

In [ ]:
# One hot encoding of 'Sex' and 'Embarked' columns

In [41]:
rf_new_1=pd.get_dummies(rf_new,columns=['Sex'])

In [43]:
rf_new_1.head(2)

,PassengerId,Pclass,Age,SibSp,Parch,Ticket,Fare,Embarked,Sex_female,Sex_male
Name,,,,,,,,,,
"Kelly, Mr. James",892,3,34.5,0,0,330911,7.8292,Q,False,True
"Wilkes, Mrs. James (Ellen Needs)",893,3,47.0,1,0,363272,7.0000,S,True,False

In [45]:
rf_new_1[['Sex_female','Sex_male']]=rf_new_1[['Sex_female','Sex_male']].astype(int)

In [47]:
rf_new_1.head(1) #Conversion to numerical

,PassengerId,Pclass,Age,SibSp,Parch,Ticket,Fare,Embarked,Sex_female,Sex_male
Name,,,,,,,,,,
"Kelly, Mr. James",892,3,34.5,0,0,330911,7.8292,Q,0,1

In [49]:
rf_new_1=pd.get_dummies(rf_new_1,columns=['Embarked'])

In [51]:
rf_new_1.head(1)

,PassengerId,Pclass,Age,SibSp,Parch,Ticket,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
Name,,,,,,,,,,,,
"Kelly, Mr. James",892,3,34.5,0,0,330911,7.8292,0,1,False,True,False

In [53]:
# Conversion to numerical

rf_new_1[['Embarked_C','Embarked_Q','Embarked_S']]=rf_new_1[['Embarked_C','Embarked_Q','Embarked_S']].astype(int)

In [59]:
rf_new_1.head(3)

,PassengerId,Pclass,Age,SibSp,Parch,Ticket,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
Name,,,,,,,,,,,,
"Kelly, Mr. James",892,3,34.5,0,0,330911,7.8292,0,1,0,1,0
"Wilkes, Mrs. James (Ellen Needs)",893,3,47.0,1,0,363272,7.0000,1,0,0,0,1
"Myles, Mr. Thomas Francis",894,2,62.0,0,0,240276,9.6875,0,1,0,1,0

In [65]:
rf_new_1['Ticket'].value_counts

<bound method IndexOpsMixin.value_counts of Name
Kelly, Mr. James                                            330911
Wilkes, Mrs. James (Ellen Needs)                            363272
Myles, Mr. Thomas Francis                                   240276
Wirz, Mr. Albert                                            315154
Hirvonen, Mrs. Alexander (Helga E Lindqvist)               3101298
                                                       ...
Spector, Mr. Woolf                                       A.5. 3236
Oliva y Ocana, Dona. Fermina                              PC 17758
Saether, Mr. Simon Sivertsen                    SOTON/O.Q. 3101262
Ware, Mr. Frederick                                         359309
Peter, Master. Michael J                                      2668
Name: Ticket, Length: 418, dtype: object>

In [67]:
rf_new_1['Ticket'].nunique

<bound method IndexOpsMixin.nunique of Name
Kelly, Mr. James                                            330911
Wilkes, Mrs. James (Ellen Needs)                            363272
Myles, Mr. Thomas Francis                                   240276
Wirz, Mr. Albert                                            315154
Hirvonen, Mrs. Alexander (Helga E Lindqvist)               3101298
                                                       ...
Spector, Mr. Woolf                                       A.5. 3236
Oliva y Ocana, Dona. Fermina                              PC 17758
Saether, Mr. Simon Sivertsen                    SOTON/O.Q. 3101262
Ware, Mr. Frederick                                         359309
Peter, Master. Michael J                                      2668
Name: Ticket, Length: 418, dtype: object>

In [ ]:
# Column ' Ticket' has many unique values, hence high cardinality with object datatype.
# Data conversion using combined frequency encoding and kfold target encoding

In [69]:
from sklearn.model_selection import KFold

In [ ]:
# Frequency encoding

In [73]:
frequency_encoding_test= rf_new_1['Ticket'].value_counts().to_dict()
rf_new_1['Frequency']=rf_new_1['Ticket'].map(frequency_encoding_test)

In [75]:
rf_new_1.head(1)

,PassengerId,Pclass,Age,SibSp,Parch,Ticket,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Frequency
Name,,,,,,,,,,,,,
"Kelly, Mr. James",892,3,34.5,0,0,330911,7.8292,0,1,0,1,0,1

In [ ]:
# Initialize K-Fold Target Encoding.
# There are 3 target variables due to one hot encoding.

In [77]:
kf_1 = KFold(n_splits=2, shuffle=True, random_state = 42)
# Initialize arrays to store target-encoded values for each target column
target_encoded_C = np.zeros(len(rf_new_1))
target_encoded_Q = np.zeros(len(rf_new_1))
target_encoded_S = np.zeros(len(rf_new_1))

In [81]:
for train_idx, val_idx in kf_1.split(rf_new_1):
    train, val = rf_new_1.iloc[train_idx], rf_new_1.iloc[val_idx]

# Compute mean target for each one-hot encoded target column
    mean_target_C = train.groupby('Ticket')['Embarked_C'].mean()
    mean_target_Q = train.groupby('Ticket')['Embarked_Q'].mean()
    mean_target_S = train.groupby('Ticket')['Embarked_S'].mean()

# Map the mean target values to the validation set
    target_encoded_C[val_idx] = val['Ticket'].map(mean_target_C)
    target_encoded_Q[val_idx] = val['Ticket'].map(mean_target_Q)
    target_encoded_S[val_idx] = val['Ticket'].map(mean_target_S)

# Add encoded columns back to the dataframe

rf_new_1['Target_Encoded_C'] = target_encoded_C
rf_new_1['Target_Encoded_Q'] = target_encoded_Q
rf_new_1['Target_Encoded_S'] = target_encoded_S

rf_new_1.head(2)

,PassengerId,Pclass,Age,SibSp,Parch,Ticket,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Frequency,Target_Encoded_C,Target_Encoded_Q,Target_Encoded_S
Name,,,,,,,,,,,,,,,,
"Kelly, Mr. James",892,3,34.5,0,0,330911,7.8292,0,1,0,1,0,1,NaN,NaN,NaN
"Wilkes, Mrs. James (Ellen Needs)",893,3,47.0,1,0,363272,7.0000,1,0,0,0,1,1,NaN,NaN,NaN

In [83]:
mean_value_1 = rf_new_1['Target_Encoded_C'].mean()
print (mean_value_1)
mean_value_2 = rf_new_1['Target_Encoded_Q'].mean()
print (mean_value_2)
mean_value_3 = rf_new_1['Target_Encoded_S'].mean()
print (mean_value_3)

0.38095238095238093
0.0
0.6190476190476191

In [85]:
rf_new_1['Target_Encoded_Q'].value_counts()

Target_Encoded_Q
0.0    63
Name: count, dtype: int64

In [91]:
rf_new_1['Target_Encoded_C'].value_counts()

Target_Encoded_C
0.0    39
1.0    24
Name: count, dtype: int64

In [93]:
rf_new_1['Target_Encoded_S'].value_counts()

Target_Encoded_S
1.0    39
0.0    24
Name: count, dtype: int64

In [87]:
rf_new_1['Target_Encoded_Q'].nunique

<bound method IndexOpsMixin.nunique of Name
Kelly, Mr. James                               NaN
Wilkes, Mrs. James (Ellen Needs)               NaN
Myles, Mr. Thomas Francis                      NaN
Wirz, Mr. Albert                               NaN
Hirvonen, Mrs. Alexander (Helga E Lindqvist)   NaN
                                                ..
Spector, Mr. Woolf                             NaN
Oliva y Ocana, Dona. Fermina                   NaN
Saether, Mr. Simon Sivertsen                   NaN
Ware, Mr. Frederick                            NaN
Peter, Master. Michael J                       NaN
Name: Target_Encoded_Q, Length: 418, dtype: float64>

In [89]:
rf_new_1['Target_Encoded_Q'].isnull().sum()

355

In [ ]:
# Although there are missing values, since this is test data, null values are not treated, 
# in order to avoid biasness.

In [98]:
rf_new_1.head(2)

,PassengerId,Pclass,Age,SibSp,Parch,Ticket,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Frequency,Target_Encoded_C,Target_Encoded_Q,Target_Encoded_S
Name,,,,,,,,,,,,,,,,
"Kelly, Mr. James",892,3,34.5,0,0,330911,7.8292,0,1,0,1,0,1,NaN,NaN,NaN
"Wilkes, Mrs. James (Ellen Needs)",893,3,47.0,1,0,363272,7.0000,1,0,0,0,1,1,NaN,NaN,NaN

In [100]:
# Removing 'Ticket' column, because there are frequency and k fold columns representing the same.

In [102]:
rf_new_2=rf_new_1
rf_new_2 = rf_new_2.drop(['Ticket'], axis=1)

In [106]:
rf_new_2.head(2)

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Frequency,Target_Encoded_C,Target_Encoded_Q,Target_Encoded_S
Name,,,,,,,,,,,,,,,
"Kelly, Mr. James",892,3,34.5,0,0,7.8292,0,1,0,1,0,1,NaN,NaN,NaN
"Wilkes, Mrs. James (Ellen Needs)",893,3,47.0,1,0,7.0000,1,0,0,0,1,1,NaN,NaN,NaN

In [108]:
rf_new_2.shape

(418, 15)

In [110]:
# Removing null values from X_test

In [114]:
rf_new_2.isnull().sum()

PassengerId           0
Pclass                0
Age                  86
SibSp                 0
Parch                 0
Fare                  1
Sex_female            0
Sex_male              0
Embarked_C            0
Embarked_Q            0
Embarked_S            0
Frequency             0
Target_Encoded_C    355
Target_Encoded_Q    355
Target_Encoded_S    355
dtype: int64

In [ ]:
mean_value_a = rf_new_2['Target_Encoded_C'].mean()
print (mean_value_a)

In [ ]:
mean_value_2 = df_new_3['Target_Encoded_Q'].mean()
print (mean_value_2)

In [ ]:
mean_value_3 = df_new_3['Target_Encoded_S'].mean()
print (mean_value_3)

In [ ]:
df_new_3['Target_Encoded_C'] = df_new_3['Target_Encoded_C'].fillna(mean_value_1)
df_new_3['Target_Encoded_Q'] = df_new_3['Target_Encoded_Q'].fillna(mean_value_2)
df_new_3['Target_Encoded_S'] = df_new_3['Target_Encoded_S'].fillna(mean_value_3)